the_cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-21 Mi 13:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Cheatsheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Felix Brilej" />
<link rel="stylesheet" type="text/css" href="styles\\base.css" />
</head>
<body>
<div id="content">
<h1 class="title">The Cheatsheet</h1>

<div id="outline-container-orgaccc973" class="outline-2">
<h2 id="orgaccc973"><span class="section-number-2">1</span> Bash</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org0126af5" class="outline-3">
<h3 id="org0126af5"><span class="section-number-3">1.1</span> General commands</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-Backspace</td>
<td class="org-left">Kill word backward from point</td>
</tr>

<tr>
<td class="org-left">C-_</td>
<td class="org-left">Undo</td>
</tr>

<tr>
<td class="org-left">M-space</td>
<td class="org-left">Mark</td>
</tr>

<tr>
<td class="org-left">C-x C-x</td>
<td class="org-left">Exchange point and mark (only for current row, is not saved along with command in history)</td>
</tr>

<tr>
<td class="org-left">ESC 10 f</td>
<td class="org-left">Prefix key, inserts ffffffffff</td>
</tr>

<tr>
<td class="org-left">!!</td>
<td class="org-left">show previous command and execute it</td>
</tr>

<tr>
<td class="org-left">!-1 (!-x)</td>
<td class="org-left">Show previous command and execute it</td>
</tr>

<tr>
<td class="org-left">C-t</td>
<td class="org-left">switch character before and at cursor</td>
</tr>

<tr>
<td class="org-left">M-t</td>
<td class="org-left">switch word before and after cursor</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgcf269c6" class="outline-3">
<h3 id="orgcf269c6"><span class="section-number-3">1.2</span> Screen tricks</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-a d</td>
<td class="org-left">minimize screen</td>
</tr>

<tr>
<td class="org-left">screen -R</td>
<td class="org-left">maximize screen</td>
</tr>

<tr>
<td class="org-left">C-a \</td>
<td class="org-left">exit screen</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgefa5af4" class="outline-2">
<h2 id="orgefa5af4"><span class="section-number-2">2</span> Emacs</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgaedd426" class="outline-3">
<h3 id="orgaedd426"><span class="section-number-3">2.1</span> Commands</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-S-;</td>
<td class="org-left">Toggle comment</td>
</tr>

<tr>
<td class="org-left">C-x h</td>
<td class="org-left">mark buffer</td>
</tr>

<tr>
<td class="org-left">M-h</td>
<td class="org-left">mark paragraph</td>
</tr>

<tr>
<td class="org-left">C-c C-x C-d</td>
<td class="org-left">Show timers behind tasks (org-clock-display)</td>
</tr>

<tr>
<td class="org-left">M-x rename-buffer</td>
<td class="org-left">rename buffer, useful for similar files</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">org-agenda</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">b</td>
<td class="org-left">switch to previous week</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">switch to next week</td>
</tr>

<tr>
<td class="org-left">C a L</td>
<td class="org-left">Show scheduled tasks</td>
</tr>

<tr>
<td class="org-left">C a n</td>
<td class="org-left">Show scheduled, then unscheduled tasks</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd709c07" class="outline-3">
<h3 id="orgd709c07"><span class="section-number-3">2.2</span> List of tips</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tips</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Org-mode</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">write in the past, makes more sense to other people who read it later</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Execute <code>org-lint</code> for debugging of source-blocks.</td>
</tr>

<tr>
<td class="org-left">Helpful when exporting produces errors.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Startup visibility for one headline:</td>
</tr>

<tr>
<td class="org-left">:Properties:</td>
</tr>

<tr>
<td class="org-left">:Visibility: children (content/all)</td>
</tr>

<tr>
<td class="org-left">:End:</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">To set file-specific source-block settings put this to the top:</td>
</tr>

<tr>
<td class="org-left">#+PROPERTY:   header-args :eval never-export</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">cua-mode</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">1. Activate cua-mode</td>
</tr>

<tr>
<td class="org-left">2. Move point to beginning of rect and press c-ret</td>
</tr>

<tr>
<td class="org-left">3. Move point to end of rect and press M-i</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org7fd9281" class="outline-2">
<h2 id="org7fd9281"><span class="section-number-2">3</span> Vim</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgca50b60" class="outline-3">
<h3 id="orgca50b60"><span class="section-number-3">3.1</span> General commands</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">hjkl</td>
<td class="org-left">use these to move</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">delete character at point</td>
</tr>

<tr>
<td class="org-left">A</td>
<td class="org-left">enter insert mode after current line</td>
</tr>

<tr>
<td class="org-left">C-c</td>
<td class="org-left">exit insert-mode</td>
</tr>

<tr>
<td class="org-left">:e filename</td>
<td class="org-left">edit another file</td>
</tr>

<tr>
<td class="org-left">gf</td>
<td class="org-left">open file at point</td>
</tr>

<tr>
<td class="org-left">zz</td>
<td class="org-left">center the screen</td>
</tr>

<tr>
<td class="org-left">S-zz</td>
<td class="org-left">save file and exit</td>
</tr>

<tr>
<td class="org-left">:%s/foo/gar/gc</td>
<td class="org-left">replace every foo with bar in current file with confirmation</td>
</tr>

<tr>
<td class="org-left">C-F</td>
<td class="org-left">page down</td>
</tr>

<tr>
<td class="org-left">C-B</td>
<td class="org-left">page up</td>
</tr>

<tr>
<td class="org-left">:match Todo <span class="underline"><i>regexp of word</i></span></td>
<td class="org-left">highlight a specific word</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">C-w v</td>
<td class="org-left">split the window vertically</td>
</tr>

<tr>
<td class="org-left">C-w s</td>
<td class="org-left">split the window horizontically</td>
</tr>

<tr>
<td class="org-left">C-w q</td>
<td class="org-left">close the current window</td>
</tr>

<tr>
<td class="org-left">C-w C-w</td>
<td class="org-left">jump to next window</td>
</tr>

<tr>
<td class="org-left">C-w arrow</td>
<td class="org-left">jump to window in arrow-direction</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4e30013" class="outline-3">
<h3 id="org4e30013"><span class="section-number-3">3.2</span> Commands defined in my .vimrc</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-p</td>
<td class="org-left">switch current line with previous one</td>
</tr>

<tr>
<td class="org-left">M-n</td>
<td class="org-left">switch current line with next one</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge00968d" class="outline-3">
<h3 id="orge00968d"><span class="section-number-3">3.3</span> Workflows</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Comment / Uncomment a selection of lines<br />
<ol class="org-ol">
<li>move to the beginning of intended selection<br /></li>
<li>C-V (enter visual mode)<br /></li>
<li>move to the end of the intended selection<br /></li>
<li>S-I # C-c<br /></li>
<li>Give it a second<br /></li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org716e344" class="outline-3">
<h3 id="org716e344"><span class="section-number-3">3.4</span> Cheatsheets</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li><a href="http://www.lagmonster.org/docs/vi2.html">http://www.lagmonster.org/docs/vi2.html</a><br /></li>
<li><a href="http://zzapper.co.uk/vimtips.html">http://zzapper.co.uk/vimtips.html</a><br /></li>
<li>(also check out the vim poster in this directory)<br /></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
